tomekceszke/water-controller/firmware/sdkconfig.defaults
# water-controller: ESP32-WROOM-32 DevKit, 4 MB flash
CONFIG_IDF_TARGET="esp32"

# Flash: must match the legacy bootloader settings (DIO, 40 MHz, 4 MB)
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Bootloader: native OTA rollback, small and quiet (region limit 28 KB)
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y

# App
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y

# Watchdogs: a hung Tier 1 task resets the device (the valve state survives the reset)
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_INT_WDT=y

# Pulse diagnostics ISR runs during flash writes (OTA, NVS)
CONFIG_GPIO_CTRL_FUNC_IN_IRAM=y

# WiFi / lwIP
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
CONFIG_ESP_WIFI_11KV_SUPPORT=y
CONFIG_ESP_PHY_REDUCE_TX_POWER=y
CONFIG_LWIP_IPV6=n

# HTTP server: session cookie + CSRF headers
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# esp_timer callbacks (WiFi reconnect, delayed restart) log through UDP
CONFIG_ESP_TIMER_TASK_STACK_SIZE=4096

# MQTT outbox: telemetry older than 1 h is dropped
CONFIG_MQTT_USE_CUSTOM_CONFIG=y
CONFIG_MQTT_OUTBOX_EXPIRED_TIMEOUT_MS=3600000
CONFIG_HOME_IDF_MQTT=y
